#  concat() function

In [1]:
import pandas as pd

In [4]:
nepal_weather = pd.DataFrame({ 'cities':['bkt','ktm','pkr'],
                              'temp':[25,30,17],
                              'humidity':[23,35,18]})
nepal_weather

  cities  temp  humidity
0    bkt    25        23
1    ktm    30        35
2    pkr    17        18

In [5]:
india_weather = pd.DataFrame({ 'cities':['mumbai','rajesthan','jaipur'],
                              'temp':[20,40,27],
                              'humidity':[23,34,24]})
india_weather

      cities  temp  humidity
0     mumbai    20        23
1  rajesthan    40        34
2     jaipur    27        24

In [9]:
cancat_data = pd.concat([nepal_weather,india_weather],ignore_index = True)
cancat_data

      cities  temp  humidity
0        bkt    25        23
1        ktm    30        35
2        pkr    17        18
3     mumbai    20        23
4  rajesthan    40        34
5     jaipur    27        24

In [15]:
cd = pd.concat([nepal_weather,india_weather],keys=['nep','ind'])
cd

          cities  temp  humidity
nep 0        bkt    25        23
    1        ktm    30        35
    2        pkr    17        18
ind 0     mumbai    20        23
    1  rajesthan    40        34
    2     jaipur    27        24

In [17]:
cd.loc['nep']

  cities  temp  humidity
0    bkt    25        23
1    ktm    30        35
2    pkr    17        18

# "axis" argument in concat() function

In [30]:
n_w = pd.DataFrame({ 'cities':['bkt','ktm','pkr'],
                              'temp':[25,30,17]},index=[0,1,2])
n_w

  cities  temp
0    bkt    25
1    ktm    30
2    pkr    17

In [31]:
n_w1 = pd.DataFrame({ 'cities':['ktm','bkt',],
                              'humidity':[23,35]},index=[1,0])
n_w1

  cities  humidity
1    ktm        23
0    bkt        35

In [32]:
df = pd.concat([n_w,n_w1],axis = 1)
df

  cities  temp cities  humidity
0    bkt    25    bkt      35.0
1    ktm    30    ktm      23.0
2    pkr    17    NaN       NaN

# Join dataframe with series() function

In [36]:
p = pd.Series(['rain','sunny','humid'],name='event')
p

0     rain
1    sunny
2    humid
Name: event, dtype: object

In [38]:
df1 = pd.concat([df,p],axis=1)
df1

  cities  temp cities  humidity  event
0    bkt    25    bkt      35.0   rain
1    ktm    30    ktm      23.0  sunny
2    pkr    17    NaN       NaN  humid